#include "FIR_Filter.h"
#include "MQueue.h"
#include "bsp_dwt.h"

#define hLength 161
// FIR滤波器参数
static double coefficient = 4.0;
static Queue FIRQueue;
static float FIRResult;
static float FIRA[hLength];
static double B[161] = {
    -1.104587824635e-06, -3.30765288084e-07, 6.469557905197e-07, 2.354792370333e-06,
    4.613259754644e-06, 6.877479993928e-06, 8.237049198786e-06, 7.558936626691e-06,
    3.788971148408e-06, -3.623848847902e-06, -1.427538238554e-05, -2.647155435505e-05,
    -3.717488350579e-05, -4.236786223392e-05, -3.788474498342e-05, -2.063216063947e-05,
    1.003324496041e-05, 5.113408663599e-05, 9.553680832838e-05, 0.0001324352646621,
    0.0001490628825309, 0.0001335519048098, 7.850129689465e-05, -1.552301519343e-05,
    -0.000137547975341, -0.0002658042593173, -0.0003701010370572, -0.0004171261821494,
    -0.0003780894912395, -0.0002373438145375, -1.701986658015e-18, 0.0003036972242474,
    0.000619188232845, 0.0008747139088742, 0.0009944873077503, 0.000916089676601,
    0.0006087713144456, 8.835700253944e-05, -0.0005756611688794, -0.001264303369241,
    -0.00182600060318, -0.002104876596178, -0.001976059132852, -0.001381105279486,
    -0.0003552282206677, 0.0009616648412149, 0.00233583791841, 0.003474169866146,
    0.004078695334442, 0.003912505763598, 0.002864124412349, 0.000995570008819,
    -0.001439527443595, -0.004016978287615, -0.006204281185006, -0.007457327047886,
    -0.00733619066631, -0.005618081778844, -0.002382762583926, 0.001952112154742,
    0.006661024610152, 0.01080982348891, 0.01341421446485, 0.01363410556943,
    0.01097007287533, 0.005423497886492, -0.002415610166809, -0.01137922416383,
    -0.01984044191607, -0.02593171901878, -0.02783322176153, -0.02408663464818,
    -0.01388122282339, 0.002740281371631, 0.02479787236787, 0.05043558413653,
    0.07712685401238, 0.1019977732739, 0.1222205837105, 0.13541600842,
    0.1399996906768, 0.13541600842, 0.1222205837105, 0.1019977732739,
    0.07712685401238, 0.05043558413653, 0.02479787236787, 0.002740281371631,
    -0.01388122282339, -0.02408663464818, -0.02783322176153, -0.02593171901878,
    -0.01984044191607, -0.01137922416383, -0.002415610166809, 0.005423497886492,
    0.01097007287533, 0.01363410556943, 0.01341421446485, 0.01080982348891,
    0.006661024610152, 0.001952112154742, -0.002382762583926, -0.005618081778844,
    -0.00733619066631, -0.007457327047886, -0.006204281185006, -0.004016978287615,
    -0.001439527443595, 0.000995570008819, 0.002864124412349, 0.003912505763598,
    0.004078695334442, 0.003474169866146, 0.00233583791841, 0.0009616648412149,
    -0.0003552282206677, -0.001381105279486, -0.001976059132852, -0.002104876596178,
    -0.00182600060318, -0.001264303369241, -0.0005756611688794, 8.835700253944e-05,
    0.0006087713144456, 0.000916089676601, 0.0009944873077503, 0.0008747139088742,
    0.000619188232845, 0.0003036972242474, -1.701986658015e-18, -0.0002373438145375,
    -0.0003780894912395, -0.0004171261821494, -0.0003701010370572, -0.0002658042593173,
    -0.000137547975341, -1.552301519343e-05, 7.850129689465e-05, 0.0001335519048098,
    0.0001490628825309, 0.0001324352646621, 9.553680832838e-05, 5.113408663599e-05,
    1.003324496041e-05, -2.063216063947e-05, -3.788474498342e-05, -4.236786223392e-05,
    -3.717488350579e-05, -2.647155435505e-05, -1.427538238554e-05, -3.623848847902e-06,
    3.788971148408e-06, 7.558936626691e-06, 8.237049198786e-06, 6.877479993928e-06,
    4.613259754644e-06, 2.354792370333e-06, 6.469557905197e-07, -3.30765288084e-07,
    -1.104587824635e-06};

double h[161];

// 初始化FIR滤波器参数 完成FIR队列创建工作
void FIRInit()
{
    queueInit(&FIRQueue, FIRA, hLength);
    for (int i = 1; i <= hLength; i++) {
        queuePush(&FIRQueue, 0);
    }
    DWT_Delay(2);
    for (int j = 0; j < hLength; j++) {
        h[j] = B[j] * 65536;
    }
}

float last_data = 0xffff;

float FIR_Filter(float in)
{
    // 过滤掉重复的
    if (in == last_data)
        return FIRResult;
    else
        last_data = in;

    queuePop(&FIRQueue);      // 先弹出一个
    queuePush(&FIRQueue, in); // 向其中加入新来的元素

    double sum = 0;
    int count  = hLength - 1; // 指向h末尾的位置

    // 随后遍历整个队列 计算出滤波之后的结果
    int pointer = FIRQueue.front;
    if (FIRQueue.count == 0) {
        return 0;
    } else if (FIRQueue.front <= FIRQueue.rear) {
        while (pointer <= FIRQueue.rear) {
            sum += (FIRQueue.array[pointer] * B[count]);
            count--;
            pointer++;
        }
    } else {
        for (; pointer <= FIRQueue.maxSize - 1; pointer++) {
            sum += (FIRQueue.array[pointer] * B[count]);
            count--;
        }
        for (pointer = 0; pointer <= FIRQueue.rear; pointer++) {
            sum += (FIRQueue.array[pointer] * B[count]);
            count--;
        }
    }
    FIRResult = sum * coefficient;
    return FIRResult;
}

/*
 * @brief 检测心跳
 * @param value 采样数值
 * @return 0 不是心跳 1 是心跳
 */
int heartbeat_check(float value)
{
    static float heartbeat_thresh = 0.55; // 心跳下降沿阈值，下降沿高度大于该阈值视为一次心跳
    static int is_init          = 0;
    static float up_value         = 0; // 波峰数值
    static float down_value       = 0; // 波谷数值

    if (!is_init) {
        is_init    = 1;
        up_value   = value;
        down_value = value; // 首先将当前值视为波峰，波谷
        return 0;
    }
    if (value <= down_value) { // 波形正在下降
        down_value = value;
    } else {                                               // 波形正在上升，说明检测到波谷
        if ((up_value - down_value) >= heartbeat_thresh) { // 检测到心跳
            up_value   = value;
            down_value = value; // 将当前值重新时为波峰，波谷，准备下一次检测心跳
            return 1;
        } else {
            up_value   = value;
            down_value = value; // 将当前值重新时为波峰，波谷，准备下一次检测心跳
        }
    }
    return 0;
}

/*
 * @brief 计算心跳率
 * @param is_heartbeat 是否是心跳 0 或者 1
 * @return 心跳 个/每分钟
 */
double calc_heartbeat_rate(int is_heartbeat)
{
    static double sampling_rate       = 500; // 250Hz
    static double heartbeat_rate      = 0;
    static double heartbeat_timestamp = 0;

    if (!is_heartbeat) {
        ++heartbeat_timestamp;
        return heartbeat_rate; // 直接返回心跳
    }
    heartbeat_rate      = 1.0 / heartbeat_timestamp * sampling_rate * 60;
    heartbeat_timestamp = 0;
    return heartbeat_rate;
}
